{"format": "graph-model", "generatedBy": "2.16.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_85": {"name": "keras_tensor_85:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_5_1/conv2d_20_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_20_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_21_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_21_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_22_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_22_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_23_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_23_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/flatten_5_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_10_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20736"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_11_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_85", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "150"}, {"size": "150"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_20_1/convolution", "op": "Conv2D", "input": ["keras_tensor_85", "StatefulPartitionedCall/sequential_5_1/conv2d_20_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_20_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5_1/conv2d_20_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_20_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_5_1/conv2d_20_1/Relu", "StatefulPartitionedCall/sequential_5_1/batch_normalization_20_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling2d_20_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5_1/batch_normalization_20_1/batchnorm/mul_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_21_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5_1/max_pooling2d_20_1/MaxPool2d", "StatefulPartitionedCall/sequential_5_1/conv2d_21_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_21_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5_1/conv2d_21_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_21_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_5_1/conv2d_21_1/Relu", "StatefulPartitionedCall/sequential_5_1/batch_normalization_21_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling2d_21_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5_1/batch_normalization_21_1/batchnorm/mul_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_22_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5_1/max_pooling2d_21_1/MaxPool2d", "StatefulPartitionedCall/sequential_5_1/conv2d_22_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_22_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5_1/conv2d_22_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_22_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_5_1/conv2d_22_1/Relu", "StatefulPartitionedCall/sequential_5_1/batch_normalization_22_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling2d_22_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5_1/batch_normalization_22_1/batchnorm/mul_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_23_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_5_1/max_pooling2d_22_1/MaxPool2d", "StatefulPartitionedCall/sequential_5_1/conv2d_23_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_23_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5_1/conv2d_23_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_23_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_5_1/conv2d_23_1/Relu", "StatefulPartitionedCall/sequential_5_1/batch_normalization_23_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/max_pooling2d_23_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_5_1/batch_normalization_23_1/batchnorm/mul_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/flatten_5_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_5_1/max_pooling2d_23_1/MaxPool2d", "StatefulPartitionedCall/sequential_5_1/flatten_5_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_10_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_5_1/flatten_5_1/Reshape", "StatefulPartitionedCall/sequential_5_1/dense_10_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_10_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_5_1/dense_10_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_11_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_5_1/dense_10_1/Relu", "StatefulPartitionedCall/sequential_5_1/dense_11_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_11_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_5_1/dense_11_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_5_1/dense_11_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_5_1/conv2d_20_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_20_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_21_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_21_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_22_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_22_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/conv2d_23_1/convolution/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/batch_normalization_23_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/flatten_5_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_10_1/Cast/ReadVariableOp", "shape": [20736, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_11_1/Cast/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}]}]}